{
  "beach": {
    "description": [
      {
        "id": 1,
        "description": "You awaken at a beach, you have nothing but your clothes and a need to survive, what are you going to do? Last thing you remember is your boat crashing, maybe there are other survivors?"
      },
      {
        "id": 2,
        "description": "The beach looks just as barren as the last time you were here. The wreckage remains scattered, and the endless horizon still offers no hope of rescue."
      },
      {
        "id": 3,
        "description": "You've returned to the same stretch of sand where you first washed ashore. Every step feels heavier now, knowing how little this place has to offer."
      },
      {
        "id": 4,
        "description": "The sand feels even hotter beneath your feet this time. Despite the familiarity, each glance at the wreckage sends a rush of despair through you."
      }
    ],
    "connections": ["shipwreck", "forest"],
    "activities": [
      {
        "id": "Fish",
        "text": "You walked up to the sea and started fishing. |You felt the fishing rod moving and pulled, you got a fish. |You sat there for what felt like hours but nothing, you walked back in disappointment."
      },
      {
        "id": "dirty_water",
        "text": "You walked up to the sea and collected salt water."
      }
    ],
    "interact": [
      {
      "id": "sleep",
      "text": "You went to sleep; You awaken feeling rested, you have recovered x actions"
    },
    {
      "id": "campfire",
      "text": "You used your campfire and cooked your food and water."
    },
    {
      "id": "investegate",
      "text": "You investegated the beach but found noting of intrest."
    },
    {
      "id": "bath",
      "text": "You step into the cold water and you wash away the grime, leaving you feeling refreshed and clear-headed."
    }
  ]
    
  },
  "shipwreck": {
    "description": [
      {
        "id": 1,
        "description": "You arrive at the shipwreck, no one else made it, you are the sole survivor, now it's time to do just that; Survive."
      },
      {
        "id": 2,
        "description": "The shipwreck looks even worse than when you first found it. There's nothing new here—just the sad remains of the boat that failed to keep you safe."
      },
      {
        "id": 3,
        "description": "Back at the wreckage, you're reminded of the night of the storm. It hasn't gotten any easier to look at, but maybe there's still something useful you missed before."
      },
      {
        "id": 4,
        "description": "The wreck still sits there, as silent and haunting as ever. It's hard to believe that the ship once carried hope and dreams."
      }
    ],
    "connections": ["beach"],
    "activities": [
      {
        "id": "food",
        "text": "You walked in the shipwreck and looked for anything useful, you found your lunch box that you had not eaten before the crash, you also found a bottle of water. |On your way out you spotted a flare and took it."
      }
    ],
"interact": [
  {
    "id": "sleep",
    "text": "You went to sleep; You awaken feeling rested, you have recovered x actions"
  },
  {
    "id": "campfire",
    "text": "You used your campfire and cooked your food and water."
  },
  {
    "id": "investegate",
    "text": "You investegated the beach but found noting of intrest."
  },
  {
    "id": "repair",
    "text": "You examine the damaged boat, thinking there might still be hope. With enough planks and effort, you could patch it up. |After hours of hard work, the boat is finally repaired—it's not perfect, but it just might carry you off this island."
  }
  ]  },
  "forest": {
    "description": [
      {
        "id": 1,
        "description": "A huge forest stands before you, the sound of birds singing and rabbits scurrying is almost soothing. You see berries and mushrooms growing along the ground."
      },
      {
        "id": 2,
        "description": "The familiar sights and sounds of the forest greet you once more. You've foraged here before, but it feels like the trees are hiding something deeper this time."
      },
      {
        "id": 3,
        "description": "As you step into the familiar forest, a strange calm washes over you. The wildlife seems quieter today, almost as if it's watching your every move from the shadows."
      },
      {
        "id": 4,
        "description": "The deeper you go into the forest, the more you realize how silent it can be. It feels like nature itself is holding its breath, watching your every move."
      }
    ],
    "connections": ["beach", "river", "deep_forest", "volcano", "ruins"],
    "activities": [
      {
        "id": "sticks",
        "text": "You tried to find some useful materials, you found x sticks "
      },
      {
        "id": "planks",
        "text": "planka"
      },
      {
        "id": "twine",
        "text": "You tried to find some useful materials, you found x twines."
      },
      {
        "id": "foraging",
        "text": "While looking for materials you passed by some mushrooms you took them with you."
      },
      {
        "id": "hunt",
        "text": "You found some footprints from a rabbit and followed them, you found a rabbit and attacked it. |You managed to land a hit and killed it. |But it fled."
      }
    ],
"interact": [
  {
    "id": "sleep",
    "text": "You went to sleep; You awaken feeling rested, you have recovered x actions"
  },
  {
    "id": "campfire",
    "text": "You used your campfire and cooked your food and water."
  },
  {
    "id": "investegate",
    "text": "You investegated the beach but found noting of intrest."
  }
  ]  },
  "river": {
    "description": [
      {
        "id": 1,
        "description": "Before you runs a small river, within it there are fish swimming and to the side there are animals bathing or drinking the river water."
      },
      {
        "id": 2,
        "description": "The river flows swiftly, its clear waters teeming with life. You can see fish darting below the surface and hear the gentle rustle of animals nearby."
      },
      {
        "id": 3,
        "description": "Standing by the riverbank, you watch as creatures come to drink. The sound of flowing water provides a sense of calm amidst the uncertainty of your situation."
      },
      {
        "id": 4,
        "description": "The familiar rush of the river greets you again, but this time, you notice fewer animals. The wilderness feels emptier, as if it's retreating from your presence."
      }
    ],
    "connections": ["lake", "forest"],
    "activities": [
      {
        "id": "fish",
        "text": "You walked up to the river and started fishing. |You felt the fishing rod moving and pulled, you got a fish. |You sat there for what felt like hours but nothing, you walked back in disappointment."
      },
      {
        "id": "stone",
        "text": "You walked up to the river and picked up a stone."
      },
      {
        "id": "water",
        "text": "You walked up to the river and collected some clean water."
      }
    ],
"interact": [
  {
    "id": "sleep",
    "text": "You went to sleep; You awaken feeling rested, you have recovered x actions"
  },
  {
    "id": "campfire",
    "text": "You used your campfire and cooked your food and water."
  },
  {
    "id": "investegate",
    "text": "You investegated the beach but found noting of intrest."
  },
  {
    "id": "bath",
    "text": "You step into the flowing river, the cold water rushing past you as you wash away the grime. You feel refreshed and clear-headed."
  }
  ]  },
  "deep_forest": {
    "description": [
      {
        "id": 1,
        "description": "Going deeper into the forest reveals more of nature's bounty, but in the distance you hear wolves howling, you feel uneasy."
      },
      {
        "id": 2,
        "description": "You've ventured this far before, and the sense of unease returns with every step. The howls are louder now, and you can't shake the feeling that something is watching you."
      },
      {
        "id": 3,
        "description": "You push further into the forest again, knowing full well the dangers that lurk here. The wolves sound closer this time, and the unease grows stronger with each visit."
      },
      {
        "id": 4,
        "description": "Every return to the deep forest fills you with dread. The howls are no longer distant—they're surrounding you, closing in with every step you take."
      }
    ],
    "connections": ["forest"],
    "activities": [
      {
        "id": "hunt",
        "text": "You found some footprints from a deer and followed them, you found a rabbit and attacked it and you managed to land a hit and killed it. |You found some footprints from a deer and followed them, you found a rabbit and attacked it but it fled."
      },
      {
        "id": "sticks",
        "text": "You tried to find some useful materials, you found x sticks "
      },
      {
        "id": "planks",
        "text": "planka"
      },
      {
        "id": "foraging",
        "text": "While looking for materials you passed by some mushrooms/berries you took them with you."
      },
      {
        "id": "twine",
        "text": "You tried to find some useful materials, you found x vines."
      }
    ],
"interact": [
  {
    "id": "sleep",
    "text": "You went to sleep; You awaken feeling rested, you have recovered x actions"
  },
  {
    "id": "campfire",
    "text": "You used your campfire and cooked your food and water."
  },
  {
    "id": "investegate",
    "text": "You investegated the beach but found noting of intrest."
  }
  ]  },
  "lake": {
    "description": [
      {
        "id": 1,
        "description": "As you followed the river you now stand before a huge lake, the wildlife is abundant."
      },
      {
        "id": 2,
        "description": "The lake is as tranquil as before, though now you can sense the changes in the wildlife around it. The once plentiful animals seem warier of you."
      },
      {
        "id": 3,
        "description": "You stand at the lake again, but it feels different. The wildlife has grown quieter, and the water, though still beautiful, holds an underlying sense of foreboding."
      },
      {
        "id": 4,
        "description": "The surface of the lake is still, almost too still. The usual sounds of nature seem to have disappeared, leaving you with an eerie silence."
      }
    ],
    "connections": ["river"],
    "activities": [
      {
        "id": "stone",
        "text": "You walked up to the lake and picked up a stone."
      },
      {
        "id": "dirty_water",
        "text": "You walked up to the lake and collected some dirty water."
      },
      {
        "id": "fish",
        "text": "You walked up to the lake and started fishing. |You felt the fishing rod moving and pulled, you got a fish. |You sat there for what felt like hours but nothing, you walked back in disappointment."
      }
    ],
"interact": [
  {
    "id": "sleep",
    "text": "You went to sleep; You awaken feeling rested, you have recovered x actions"
  },
  {
    "id": "campfire",
    "text": "You used your campfire and cooked your food and water."
  },
  {
    "id": "investegate",
    "text": "You investegated the beach but found noting of intrest."
  },
  {
    "id": "bath",
    "text": "You step into the cold water and you wash away the grime, leaving you feeling refreshed and clear-headed."
  }
  ]  },
  "volcano": {
    "description": [
      {
        "id": 1,
        "description": "You've arrived at the centerpiece of the island, the volcano. You don't know why but you feel like it's dangerous to be here."
      },
      {
        "id": 2,
        "description": "The volcano looms just as ominously as before. The ground trembles more frequently now, and you can feel the heat rising—something is changing here."
      },
      {
        "id": 3,
        "description": "You return to the volcano's base, and the tension in the air is palpable. Every time you come here, the island feels closer to erupting, as if time is running out."
      },
      {
        "id": 4,
        "description": "The volcano's rumble is deeper this time. You can't help but think it's a warning, a signal that this place won't remain dormant much longer."
      },
      {
        "id": 5,
        "description": "The air around the volcano is thick with heat and ash. It's as if the island itself is breathing, preparing for something catastrophic."
      }
    ],
    "connections": ["forest", "hotspring"],
    "activities": [],
"interact": [
  {
    "id": "sleep",
    "text": "You went to sleep; You awaken feeling rested, you have recovered x actions"
  },
  {
    "id": "campfire",
    "text": "You used your campfire and cooked your food and water."
  },
  {
    "id": "investegate",
    "text": "You investegated the beach but found noting of intrest."
  }
  ]  },
  "hotspring": {
    "description": [
      {
        "id": 1,
        "description": "After walking around the volcano you stumble across this natural hotspring, taking a bath here would most certainly soothe your nerves."
      },
      {
        "id": 2,
        "description": "You've been to the hotsprings before, and the warmth is just as comforting. But you can't shake the thought that every moment spent here is time wasted."
      },
      {
        "id": 3,
        "description": "You walk into the warm air of the hotspring once more, but the comfort is fleeting. With the volcano nearby, the peace of this place feels more fragile with each visit."
      },
      {
        "id": 4,
        "description": "The steam rising from the hotspring is as inviting as ever, but the weight of survival pulls at you. There's no time for luxury, not anymore."
      }
    ],
    "connections": ["volcano"],
    "activities": [],
"interact": [
  {
    "id": "sleep",
    "text": "You went to sleep; You awaken feeling rested, you have recovered x actions"
  },
  {
    "id": "campfire",
    "text": "You used your campfire and cooked your food and water."
  },
  {
    "id": "investegate",
    "text": "You investegated the beach but found noting of intrest."
  },
  {
    "id": "bath",
    "text": "The natural hot springs are a welcome relief from the constant survival grind. You dip into the steaming waters, letting your body relax"
  }
  ]  },
  "ruins": {
    "description": [
      {
        "id": 1,
        "description": "After following the hidden stone path you find yourself standing before ancient ruins, you don't know why but your gut is telling you to investigate further."
      },
      {
        "id": 2,
        "description": "The ruins seem more mysterious each time you visit. The carvings you noticed before seem to have shifted, or perhaps it's just your mind playing tricks on you."
      },
      {
        "id": 3,
        "description": "Standing among the crumbling stone of the ruins, you sense there are still secrets buried here. Every visit only scratches the surface of what this place holds."
      },
      {
        "id": 4,
        "description": "The ruins have an ancient weight to them, a silent history you can almost feel pressing down on you. Every time you return, it feels as though they are waiting for something."
      }
    ],
    "connections": ["forest"],
    "activities": [],
"interact": [
  {
    "id": "sleep",
    "text": "You went to sleep; You awaken feeling rested, you have recovered x actions"
  },
  {
    "id": "campfire",
    "text": "You used your campfire and cooked your food and water."
  },
  {
    "id": "investegate",
    "text": "You investegated the beach but found noting of intrest."
  }
  ]  }
}
